package com.example.wantedtestassigment.NumbersTask.enums;

public enum NumberWords {
    UNITS(new String[]{
            "", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
            "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
            "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"
    }),

    TENS(new String[]{
            "", "десять", "двадцать", "тридцать", "сорок", "пятьдесят",
            "шестьдесят", "семьдесят", "восемьдесят", "девяносто"
    }),

    HUNDREDS(new String[]{
            "", "сто", "двести", "триста", "четыреста",
            "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"
    }),

    THOUSANDS(new String[]{
            "", "одна тысяча", "две тысячи", "три тысячи", "четыре тысячи",
            "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч", "девять тысяч",
            "десять тысяч", "одиннадцать тысяч", "двенадцать тысяч", "тринадцать тысяч",
            "четырнадцать тысяч", "пятнадцать тысяч", "шестнадцать тысяч",
            "семнадцать тысяч", "восемнадцать тысяч", "девятнадцать тысяч"
    });

    private final String[] words;

    NumberWords(String[] words) {
        this.words = words;
    }

    public String[] getWords() {
        return words;
    }
}
